In [21]:
import pandas as pd
import numpy as np

In [23]:
open_text = pd.read_csv ('https://resources.oreilly.com/examples/0636920023784/raw/master/pydata-book-master/ch06/ex1.csv')

#!cat examples\ex1.csv
#a,b,c,d,message
#1,2,3,4,hello
#5,6,7,8,world
#9,10,11,12,foo

In [25]:
open_text

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [30]:
open_text2 = pd.read_csv ('https://resources.oreilly.com/examples/0636920023784/raw/master/pydata-book-master/ch06/ex2.csv', names = ['a','b','c','d','message'])

In [31]:
open_text2

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [32]:
names = ['a','b','c','d','message']

In [43]:
open_text3 = pd.read_csv ('https://resources.oreilly.com/examples/0636920023784/raw/master/pydata-book-master/ch06/ex1.csv', names = names, index_col ='message')

In [44]:
open_text3

         a   b   c   d
message
message  a   b   c   d
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [46]:
open_text4 = pd.read_csv ('https://resources.oreilly.com/examples/0636920023784/raw/master/pydata-book-master/ch06/csv_mindex.csv', names = names, index_col ='message')

In [47]:
open_text4

            a     b       c       d
message
NaN      key1  key2  value1  value2
NaN       one     a       1       2
NaN       one     b       3       4
NaN       one     c       5       6
NaN       one     d       7       8
NaN       two     a       9      10
NaN       two     b      11      12
NaN       two     c      13      14
NaN       two     d      15      16

In [57]:
### To form a hierarchical index from multiple columns
parsed = pd.read_csv('https://resources.oreilly.com/examples/0636920023784/raw/master/pydata-book-master/ch06/csv_mindex.csv', index_col =['key1','key2'])

In [58]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [65]:
### Passing an expression as a delimited for delimiter
result = pd.read_csv('https://resources.oreilly.com/examples/0636920023784/raw/master/pydata-book-master/ch06/ex3.txt', '\s+')

In [66]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [67]:
skip_rows= pd.read_csv('https://resources.oreilly.com/examples/0636920023784/raw/master/pydata-book-master/ch06/ex4.csv')

In [68]:
skip_rows

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [69]:
skip_rows= pd.read_csv('https://resources.oreilly.com/examples/0636920023784/raw/master/pydata-book-master/ch06/ex4.csv', skiprows = [0,2,3])

In [70]:
skip_rows

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [71]:
skip_rows= pd.read_csv('https://resources.oreilly.com/examples/0636920023784/raw/master/pydata-book-master/ch06/ex5.csv')

In [72]:
skip_rows

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [75]:
pd.isnull(skip_rows)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [76]:
skip_rows= pd.read_csv('https://resources.oreilly.com/examples/0636920023784/raw/master/pydata-book-master/ch06/ex5.csv', na_values = ['NULL'])

In [77]:
skip_rows

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [78]:
sentinels = {'message': ['foo','NA'], 'something': ['two']}

In [79]:
skip_rows= pd.read_csv('https://resources.oreilly.com/examples/0636920023784/raw/master/pydata-book-master/ch06/ex5.csv', na_values=sentinels)

In [80]:
skip_rows

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [81]:
import sqlalchemy as sqla

import pandas as pd

db = sqla.create_engine("mysql+pymysql://anonymous:@ensembldb.ensembl.org:3306/aedes_aegypti_core_48_1b")

ModuleNotFoundError: No module named 'pymysql'